[
  { "q": "Why are forests called green lungs?", "a": "Because they release oxygen and help maintain the oxygen–carbon dioxide balance." },
  { "q": "What is the uppermost layer of vegetation in a forest called?", "a": "Canopy" },
  { "q": "What is the branchy part of a tree above the stem called?", "a": "Crown" },
  { "q": "What forms the lowest layer of vegetation in a forest?", "a": "Herbs" },
  { "q": "What is the layer between the canopy and herbs called?", "a": "Understorey (shrubs)" },
  { "q": "Name two products obtained from forests.", "a": "Timber, medicinal plants" },
  { "q": "What is the dark substance formed from decaying plants and animals?", "a": "Humus" },
  { "q": "Who converts dead plants and animals into humus?", "a": "Decomposers" },
  { "q": "Give two examples of decomposers found in forests.", "a": "Mushrooms and insects like beetles" },
  { "q": "Why is the forest floor often spongy?", "a": "Due to layers of dead leaves and decaying organic matter." },
  { "q": "What helps seeds of plants in forests to disperse and grow?", "a": "Animals through droppings and movement" },
  { "q": "What prevents soil erosion in forests?", "a": "Roots of trees binding the soil" },
  { "q": "What role do forests play in the water cycle?", "a": "They help rainwater seep into the ground and maintain the water table." },
  { "q": "What is meant by 'forest regeneration'?", "a": "The natural growth of new plants and trees in the forest." },
  { "q": "Name a few animals commonly found in forests.", "a": "Boar, bison, elephants, jackals" },
  { "q": "What do tribes living in forests depend on forests for?", "a": "Food, shelter, medicines, and water" },
  { "q": "Why does the forest floor remain dark?", "a": "Because the dense canopy blocks most sunlight." },
  { "q": "What is soil erosion?", "a": "The washing away of the top fertile layer of soil." },
  { "q": "What happens to animal droppings in the forest?", "a": "They decompose and help seedlings grow." },
  { "q": "How do forests control floods?", "a": "By absorbing rainwater and slowing the flow of water." },
  { "q": "Which layer of vegetation houses most insects and small animals?", "a": "The forest floor" },
  { "q": "Why is there no waste in a forest?", "a": "Everything is recycled by decomposers into nutrients." },
  { "q": "What is the importance of humus?", "a": "It enriches soil with nutrients for plant growth." },
  { "q": "How do forests influence the climate?", "a": "They keep the air cool and increase rainfall." },
  { "q": "What is deforestation?", "a": "Large-scale removal of trees from forests." },
  { "q": "What happens if forests disappear?", "a": "Soil erosion, reduced rainfall, increased CO₂, and loss of habitats." },
  { "q": "What is seed dispersal?", "a": "The spreading of seeds by wind, water, or animals." },
  { "q": "Name two examples of forest trees mentioned in the chapter.", "a": "Teak, neem" },
  { "q": "Why should we conserve forests?", "a": "They support life, maintain climate, and provide essential resources." },
  { "q": "What makes a forest a 'dynamic living entity'?", "a": "Continuous interactions among plants, animals, soil, air, and water." }
]
