[
  { "q": "What is the fluid that flows inside blood vessels?", "a": "Blood" },
  { "q": "What substance carries oxygen in the blood?", "a": "Haemoglobin" },
  { "q": "Which cells fight against germs?", "a": "White blood cells (WBC)" },
  { "q": "What helps in the clotting of blood?", "a": "Platelets" },
  { "q": "Which vessels carry oxygen-rich blood from the heart?", "a": "Arteries" },
  { "q": "Which vessels carry blood back to the heart?", "a": "Veins" },
  { "q": "What are the smallest blood vessels called?", "a": "Capillaries" },
  { "q": "What is the throbbing felt in the arteries called?", "a": "Pulse" },
  { "q": "What is the normal pulse rate of a resting adult?", "a": "72–80 beats per minute" },
  { "q": "How many chambers does the human heart have?", "a": "Four chambers" },
  { "q": "What are the upper chambers of the heart called?", "a": "Atria" },
  { "q": "What are the lower chambers of the heart called?", "a": "Ventricles" },
  { "q": "What prevents the mixing of oxygen-rich and carbon dioxide-rich blood?", "a": "The partition between heart chambers" },
  { "q": "What instrument is used to listen to heartbeats?", "a": "Stethoscope" },
  { "q": "What is the process of removing waste products produced in cells called?", "a": "Excretion" },
  { "q": "Which organs filter waste from the blood?", "a": "Kidneys" },
  { "q": "What tube carries urine from kidneys to the bladder?", "a": "Ureter" },
  { "q": "Where is urine stored before removal?", "a": "Urinary bladder" },
  { "q": "What is the opening through which urine is released called?", "a": "Urethra" },
  { "q": "What is the major excretory product in humans?", "a": "Urea" },
  { "q": "What do fish excrete as waste?", "a": "Ammonia" },
  { "q": "What do birds, lizards, and insects excrete?", "a": "Uric acid (semi-solid)" },
  { "q": "What vascular tissue transports water in plants?", "a": "Xylem" },
  { "q": "What vascular tissue transports food in plants?", "a": "Phloem" },
  { "q": "What tiny structures on roots absorb water?", "a": "Root hairs" },
  { "q": "What process in plants releases excess water?", "a": "Transpiration" },
  { "q": "What pulls water upward in tall trees?", "a": "Transpiration pull" },
  { "q": "Where are stomata found?", "a": "On the surface of leaves" },
  { "q": "What is the percentage of water in human urine?", "a": "95%" },
  { "q": "What generates the rhythmic beating of the heart?", "a": "Contraction and relaxation of heart muscles" }
]